# NurbsSurfaceData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NurbsSurfaceData Methods
NurbsSurfaceData Class See Also
---
The NurbsSurfaceData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Construct NurbsSurfaceData based on NURBS surface data, where the weights are supplied. The NURBS surface will be (piecewise) polynomial if all the weights are equal, rational if not. Note: A rational polynomial is a quotient of two polynomials; this includes a polynomial, which can be thought of as a quotient with denominator equal to 1. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetControlPoints | Get the list of control points. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetKnotsU | Get the list of knots in the u-direction. |
| GetKnotsV | Get the list of knots in the v-direction. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetWeights | Get the list of weights. |
| IsValid | Check if the object contains a valid NurbsSurfaceData. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace